#include "Typing.h"

const std::string& Typing::Dictionary(const std::string& _roma)
{
    static const std::unordered_map<std::string, std::string> dictionary =
    {
        {"a","あ"},{"i","い"},{"u","う"},{"e","え"},{"o","お"},
        {"ka","か"},{"ki","き"},{"ku","く"},{"ke","け"},{"ko","こ"},
        {"sa","さ"},{"si","し"},{"su","す"},{"se","せ"},{"so","そ"},
        {"ta","た"},{"ti","ち"},{"tu","つ"},{"te","て"},{"to","と"},
        {"na","な"},{"ni","に"},{"nu","ぬ"},{"ne","ね"},{"no","の"},
        {"ha","は"},{"hi","ひ"},{"hu","ふ"},{"he","へ"},{"ho","ほ"},
        {"ma","ま"},{"mi","み"},{"mu","む"},{"me","め"},{"mo","も"},
        {"ya","や"},{"yi","い"}, {"yu", "ゆ"},{"ye","いぇ"}, { "yo", "よ" },
        {"ra", "ら"}, {"ri", "り"}, {"ru", "る"}, {"re", "れ"}, {"ro", "ろ"},
        {"wa", "わ"},{"wi","うぃ"},{"wu","う"},{"we","うぇ"}, {"wo", "を"},
        {"nn", "ん"},
        {"ga", "が"}, {"gi", "ぎ"}, {"gu", "ぐ"}, {"ge", "げ"}, {"go", "ご"},
        {"za", "ざ"}, {"zi", "じ"}, {"zu", "ず"}, {"ze", "ぜ"}, {"zo", "ぞ"},
        {"da", "だ"}, {"di", "ぢ"}, {"du", "づ"}, {"de", "で"}, {"do", "ど"},
        {"ba", "ば"}, {"bi", "び"}, {"bu", "ぶ"}, {"be", "べ"}, {"bo", "ぼ"},
        {"pa", "ぱ"}, {"pi", "ぴ"}, {"pu", "ぷ"}, {"pe", "ぺ"}, {"po", "ぽ"},
        {"kya", "きゃ"},{"kyi","きぃ"}, {"kyu", "きゅ"},{"kye","きぇ"}, {"kyo", "きょ"},
        {"sya", "しゃ"},{"syi","しぃ"}, { "syu", "しゅ" },{"sye","しぇ"}, {"syo", "しょ"},
        {"tya", "ちゃ"},{"tyi","ちぃ"}, {"tyu", "ちゅ"},{"tye","ちぇ"}, {"tyo", "ちょ"},
        {"nya", "にゃ"},{"nyi","にぃ"}, {"nyu", "にゅ"},{"nye","にぇ"}, {"nyo", "にょ"},
        {"hya", "ひゃ"},{"hyi","ひぃ"}, { "hyu", "ひゅ" },{"hye","ひぇ"}, {"hyo", "ひょ"},
        {"mya", "みゃ"},{"myi","みぃ"}, { "myu", "みゅ" },{"mye","みぇ"}, {"myo", "みょ"},
        {"rya", "りゃ"},{"ryi","りぃ"}, { "ryu", "りゅ" },{"rye","りぇ"}, {"ryo", "りょ"},
        {"gya", "ぎゃ"},{"gyi","ぎぃ"}, {"gyu", "ぎゅ"},{"gye","ぎぇ"}, {"gyo", "ぎょ"},
        {"zya", "じゃ"},{"zyi","じぃ"}, {"zyu", "じゅ"},{"zye","じぇ"}, {"zyo", "じょ"},
        {"bya", "びゃ"},{"byi","びぃ"}, {"byu", "びゅ"},{"bye","びぇ"}, {"byo", "びょ"},
        {"pya", "ぴゃ"},{"pyi","ぴぃ"}, {"pyu", "ぴゅ"},{"pye","ぴぇ"}, {"pyo", "ぴょ"},
        {"vya", "ゔゃ"},{"vyi","ゔぃ"}, {"vyu", "ゔゅ"},{"vye","ゔぇ"}, {"vyo", "ゔょ"},
        {"va", "ゔぁ"}, {"vi", "ゔぃ"},{"vu", "ゔ"}, {"ve", "ゔぇ"}, {"vo", "ゔぉ"},
        {"sha", "しゃ"},{"shi","し"},{"shu","しゅ"},{"she","しぇ"},{"sho","しょ"},
        {"ja","じゃ"}, {"ji","じ"}, {"ju","じゅ"}, {"je", "じぇ"}, {"jo","じょ"},
        {"cha","ちゃ"}, {"chi","ち"}, {"chu","ちゅ"}, {"che", "ちぇ"},{"cho","ちょ"},
        {"tha", "てゃ"}, {"thi", "てぃ"}, {"thu", "てゅ"}, {"the", "てぇ"}, {"tho", "てょ"},
        {"dha", "でゃ"}, {"dhi", "でぃ"}, {"dhu", "でゅ"}, {"dhe", "でぇ"}, {"dho", "でょ"},
        {"twa", "とぁ"}, {"twi", "とぃ"}, {"twu", "とぅ"}, {"twe", "とぇ"}, {"two", "とぉ"},
        {"dwa", "どぁ"}, {"dwi", "どぃ"}, {"dwu", "どぅ"}, {"dwe", "どぇ"}, {"dwo", "どぉ"},
        {"fa", "ふぁ"}, {"fi", "ふぃ"}, {"fu", "ふ"}, {"fe", "ふぇ"}, {"fo", "ふぉ"},
        {"wha", "うぁ"}, {"whi", "うぃ"}, {"wu", "う"}, {"whe", "うぇ"}, {"who", "うぉ"},
        {"qa","くぁ"}, {"qi","くぃ"}, {"qu","く"}, {"qe","くぇ"}, {"qo","くぉ"},
        {"gwa","ぐぁ"}, {"gwi","ぐぃ"}, {"gwu","ぐ"}, {"gwe","ぐぇ"}, {"gwo","ぐぉ"},
        {"swa", "すぁ"}, {"swi", "すぃ"}, {"swu", "す"}, {"swe", "すぇ"}, {"swo", "すぉ"},
        {"zwa", "ずぁ"}, {"zwi", "ずぃ"}, {"zwu", "ず"}, {"zwe", "ずぇ"}, {"zwo", "ずぉ"},
        {"tsa", "つぁ"},{"tsi","つぃ"},{"tsu","つ"},{"tse","つぇ"},{"tso","つぉ"},
        {"qwa","くぁ"},{"qwi","くぃ"},{"qwu","く"},{"qwe","くぇ"},{"qwo","くぉ"},
        {"xtu", "っ"}, {"-","ー"},
        {"xa", "ぁ"}, {"xi", "ぃ"}, {"xu", "ぅ"}, {"xe", "ぇ"}, {"xo", "ぉ"},
        {"la", "ぁ"}, {"li", "ぃ"}, {"lu", "ぅ"}, {"le", "ぇ"}, {"lo", "ぉ"},
        {"lka", "ゕ"}, {"lke", "ゖ"},
        {"lya", "ゃ"}, {"lyu", "ゅ"}, {"lyo", "ょ"},
        {"lwa", "ゎ"},
        {"xka", "ゕ"}, {"xke", "ゖ"},
        {"xya", "ゃ"}, {"xyu", "ゅ"}, {"xyo", "ょ"},
        {"xwa", "ゎ"},
        {"shi","し"}, {"chi","ち"}, {"tsu","つ"},
        {"ji","じ"}, {"di","ぢ"}, {"du","づ"},
        {"fu","ふ"},
        {"ca","か"},{"ci","し"},{"cu","く"},{"ce","せ"},{"co","こ"},
        {",","、"}, {".","。"}, {"?","？"}, {"!","！"},{" ","　"},
        {"wu","う"},
        {"wi","ゐ"},
        {"we","ゑ"},
    };

    std::vector<std::string> decision{};
    for (const auto& r : _roma)
    {
        char tmp[10] = "\0";
        for (int i = 0; tmp[i] != '\0'; i++)
        {
            if (IsRomaVowel(tmp[i]))
            {
            }
        }
    }

    if (dictionary.find(_roma) != dictionary.end())
    {
        return dictionary.at(_roma.c_str());
    }
    else
    {
        return _roma.c_str();
    }
}

bool Typing::IsRomaVowel(char _charactor)
{
    return ('a' == _charactor)
        || ('i' == _charactor)
        || ('u' == _charactor)
        || ('e' == _charactor)
        || ('o' == _charactor);
}
